In [1]:
#loading the datasets
import pandas as pd
import numpy as np

In [4]:
#loading the excel worksheets/workbooks
file_path = r"E:\Vidya Career\IT JOB\Data Analyst Path\Projects for Data Analysis\Mini PRoject 1\swiggy_dataset.xlsx"

# Load all sheets
orders = pd.read_excel(file_path, sheet_name="orders")
customers = pd.read_excel(file_path, sheet_name="customers")
restaurants = pd.read_excel(file_path, sheet_name="restaurants")
delivery_partners = pd.read_excel(file_path, sheet_name="delivery partners")

In [6]:
#checking the shape of the tables
print("Orders:", orders.shape)
print("Customers:", customers.shape)
print("Restaurants:", restaurants.shape)
print("Delivery Partners:", delivery_partners.shape)

Orders: (15000, 14)
Customers: (500, 6)
Restaurants: (300, 5)
Delivery Partners: (500, 3)

In [7]:
orders.head()

,order_id,customer_id,restaurant_id,dish_ordered,order_time,delivery_time,order_status,price,quantity,delivery_address,expected_delivery_time,delivery_partner_id,delivery time (in mins),expected delivery time (in mins)
0,1,202,93,Dal Makhani,29-03-2024 16:36:44,29-03-2024 17:45:44,Cancelled,354.69,2,93\nChar Zila\nBangalore 678819,29-03-2024 16:58:44,370,69,22
1,2,109,292,Tandoori Chicken,25-02-2024 15:05:32,25-02-2024 17:02:32,Successful,367.28,4,80\nChad Path\nSalem 397102,25-02-2024 15:29:32,317,117,24
2,3,201,151,Paneer Tikka,09-02-2024 22:14:24,09-02-2024 23:27:24,Cancelled,720.84,1,"03\nTrivedi Marg, Bihar Sharif-004998",09-02-2024 22:51:24,298,73,37
3,4,119,119,Dosa,30-07-2024 22:43:42,31-07-2024 00:06:42,Successful,692.54,2,307\nBassi Nagar\nDewas-020122,30-07-2024 23:22:42,147,83,39
4,5,180,94,Tandoori Chicken,21-07-2024 05:52:48,21-07-2024 06:38:48,Successful,105.20,2,"410, Shanker Path\nDeoghar-519687",21-07-2024 06:22:48,280,46,30

In [8]:
#getting the information of the table
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15000 entries, 0 to 14999
Data columns (total 14 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   order_id                          15000 non-null  int64
 1   customer_id                       15000 non-null  int64
 2   restaurant_id                     15000 non-null  int64
 3   dish_ordered                      15000 non-null  object
 4   order_time                        15000 non-null  object
 5   delivery_time                     15000 non-null  object
 6   order_status                      15000 non-null  object
 7   price                             15000 non-null  float64
 8   quantity                          15000 non-null  int64
 9   delivery_address                  15000 non-null  object
 10  expected_delivery_time            15000 non-null  object
 11  delivery_partner_id               15000 non-null  int64
 12  delivery time (in mins)           15000 non-null  int64
 13  expected delivery time (in mins)  15000 non-null  int64
dtypes: float64(1), int64(7), object(6)
memory usage: 1.6+ MB

In [9]:
#checking the missing values
orders.isnull().sum()

order_id                            0
customer_id                         0
restaurant_id                       0
dish_ordered                        0
order_time                          0
delivery_time                       0
order_status                        0
price                               0
quantity                            0
delivery_address                    0
expected_delivery_time              0
delivery_partner_id                 0
delivery time (in mins)             0
expected delivery time (in mins)    0
dtype: int64


### Insight:
- We inspected data types and missing values to understand data quality issues.

In [10]:
#converting the date and time columns to its data type
orders['order_time'] = pd.to_datetime(orders['order_time'])
orders['delivery_time'] = pd.to_datetime(orders['delivery_time'])

orders.columns

C:\Users\vidya\AppData\Local\Temp\ipykernel_18300\1618931863.py:2: UserWarning: Parsing dates in %d-%m-%Y %H:%M:%S format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  orders['order_time'] = pd.to_datetime(orders['order_time'])
C:\Users\vidya\AppData\Local\Temp\ipykernel_18300\1618931863.py:3: UserWarning: Parsing dates in %d-%m-%Y %H:%M:%S format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  orders['delivery_time'] = pd.to_datetime(orders['delivery_time'])

Index(['order_id', 'customer_id', 'restaurant_id', 'dish_ordered',
       'order_time', 'delivery_time', 'order_status', 'price', 'quantity',
       'delivery_address', 'expected_delivery_time', 'delivery_partner_id',
       'delivery time (in mins)', 'expected delivery time (in mins)'],
      dtype='object')

In [11]:
#to see how many cancelled orders
orders['order_status'].value_counts()

order_status
Successful    13521
Cancelled      1479
Name: count, dtype: int64

In [14]:
#successful orders copy
orders_success = orders[orders['order_status'] == 'Successful'].copy()

In [15]:
#Total order value
orders_success['total_order_value'] = (orders_success['price'] * orders_success['quantity'])

In [18]:
#renaming the column names to make easy to analyze
orders.rename(columns = 
    { 'delivery time (in mins)': 'delivery_time_mins',
      'expected delivery time (in mins)': 'expected_delivery_time_mins'},
    inplace = True)

orders.columns

Index(['order_id', 'customer_id', 'restaurant_id', 'dish_ordered',
       'order_time', 'delivery_time', 'order_status', 'price', 'quantity',
       'delivery_address', 'expected_delivery_time', 'delivery_partner_id',
       'delivery_time_mins', 'expected_delivery_time_mins'],
      dtype='object')

In [21]:
#renaming the column names to make easy to analyze
orders_success.rename(columns = 
    { 'delivery time (in mins)': 'delivery_time_mins',
      'expected delivery time (in mins)': 'expected_delivery_time_mins'},
    inplace = True)

orders_success.columns

Index(['order_id', 'customer_id', 'restaurant_id', 'dish_ordered',
       'order_time', 'delivery_time', 'order_status', 'price', 'quantity',
       'delivery_address', 'expected_delivery_time', 'delivery_partner_id',
       'delivery_time_mins', 'expected_delivery_time_mins',
       'total_order_value'],
      dtype='object')

In [22]:
#Delivery delay
orders_success['delivery_delay'] = (
    orders_success['delivery_time_mins'] -
    orders_success['expected_delivery_time_mins']
)

In [23]:
orders_success[['total_order_value', 'delivery_delay']].head()

   total_order_value  delivery_delay
1            1469.12              93
3            1385.08              44
4             210.40              16
5            2599.50              39
6             639.68              87

### Markdown
 Helps convert raw data into business metrics.

In [24]:
#Revenue by Restaurant
revenue_by_restaurant = (
    orders_success
    .groupby('restaurant_id')['total_order_value']
    .sum()
    .reset_index()
    .sort_values(by='total_order_value', ascending=False)
)

In [25]:
#merging the restaurant names
revenue_by_restaurant = revenue_by_restaurant.merge(
    restaurants,
    on='restaurant_id',
    how='left'
)

In [26]:
revenue_by_restaurant.head(10)

,restaurant_id,total_order_value,restaurant_name,city,ratings,total_reviews
0,11,116181.42,Dosa Delight,Surat,3.7,1379
1,83,115546.99,Curry Point,Kolkata,4.5,861
2,108,114769.10,Curry Point,Kolkata,4.2,1800
3,87,109549.40,Biryani House,Delhi,3.7,397
4,207,107238.36,Biryani House,Pune,4.7,1770
5,192,104347.72,Biryani House,Kolkata,4.4,740
6,7,103308.71,Paneer Paradise,Ahmedabad,3.9,941
7,68,102113.06,Tandoori Flames,Chennai,4.8,66
8,54,101094.06,Dosa Delight,Kolkata,4.5,1785
9,155,99968.03,Pav Bhaji Hub,Mumbai,3.6,1739

### Insight
 Top restaurants contribute a share of total revenue, indicating strong brand or customer preference concentration.

In [27]:
#Top Ordered Dishes
top_dishes = (
    orders_success
    .groupby('dish_ordered')
    .size()
    .reset_index(name='order_count')
    .sort_values(by='order_count', ascending=False)
)

In [28]:
top_dishes.head(10)

       dish_ordered  order_count
3     Chole Bhature         1425
5              Dosa         1396
7         Pav Bhaji         1376
8            Samosa         1372
9  Tandoori Chicken         1354
4       Dal Makhani         1338
6      Paneer Tikka         1334
2    Butter Chicken         1320
1           Biryani         1306
0      Aloo Paratha         1300

### Insight:
 A small set of dishes dominates customer demand, suggesting opportunities for menu optimization and promotions.

In [29]:
#Top Customers by Revenue
top_customers = (
    orders_success
    .groupby('customer_id')['total_order_value']
    .sum()
    .reset_index()
    .sort_values(by='total_order_value', ascending=False)
)

In [30]:
#merging the customer data
top_customers = top_customers.merge(
    customers,
    on='customer_id',
    how='left'
)

In [31]:
top_customers.head(10)

,customer_id,total_order_value,customer_name,address,city,email,phone_number
0,443,80740.13,Samiha Das,59/554\nSekhon Chowk\nNagaon-579620,Delhi,yashvikuruvilla@gmail.com,910257278529
1,160,76989.51,Shayak Apte,"99/77, Bhandari Street, Bardhaman-002120",Kolkata,jkade@varghese-gandhi.com,913028344099
2,142,71508.94,Aradhya Comar,"18/42, Wali Road, Chapra-041921",Chennai,mohanlal22@srinivasan.info,467806904
3,91,71355.56,Vidur Srinivas,"97/06, Atwal Road, Hajipur 279486",Delhi,farhan99@hotmail.com,2540304326
4,294,70251.92,Hazel Bhalla,"37/232\nRamaswamy Path, Etawah 605655",Kolkata,ythaker@hotmail.com,914978493072
5,322,70203.28,Taran Raja,"295, Kar Path\nDehradun 682015",Ahmedabad,grovernayantara@ahuja-ghosh.org,8526656079
6,334,69659.20,Madhup Amble,"79/01, Saraf Chowk, Nangloi Jat-059606",Surat,sarkarraunak@sidhu-mane.net,9276752922
7,53,68789.83,Raunak Thaman,"94/03, Raja Circle, Bettiah-717400",Delhi,rmand@kata.com,9219980507
8,55,67999.66,Anahi Kale,"H.No. 232, Bera Ganj, Sri Ganganagar-406203",Pune,sinhanitara@dalal.com,7996676261
9,291,67480.14,Yakshit Mahajan,42\nTara Chowk\nKavali-195879,Jaipur,kartikchar@gmail.com,8014807708

### Insight:
  High-value customers generate significantly more revenue, indicating potential for loyalty and retention programs.

In [32]:
#Order Success vs Cancelled %
order_status_dist = (
    orders['order_status']
    .value_counts(normalize=True)
    .reset_index()
)
order_status_dist.columns = ['order_status', 'percentage']
order_status_dist['percentage'] = order_status_dist['percentage'] * 100

order_status_dist

  order_status  percentage
0   Successful       90.14
1    Cancelled        9.86

### Insight:
  Although most orders are successful, cancellations still represent a measurable revenue leakage.

In [35]:
#Calculate average delivery delay per partner
avg_delay_partner = (
    orders_success
    .groupby('delivery_partner_id')['delivery_delay']
    .mean()
    .reset_index()
)

In [36]:
avg_delay_partner.head()

   delivery_partner_id  delivery_delay
0                    1       37.129032
1                    2       47.894737
2                    3       39.437500
3                    4       36.903226
4                    5       35.181818

In [37]:
#Merge with delivery partner table
avg_delay_partner = avg_delay_partner.merge(
    delivery_partners,
    left_on='delivery_partner_id',
    right_on='partner_id',
    how='left'
)

In [38]:
avg_delay_partner.head()

   delivery_partner_id  delivery_delay  partner_id    partner_name       city
0                    1       37.129032           1      Taran Bala     Jaipur
1                    2       47.894737           2     Madhav Iyer     Mumbai
2                    3       39.437500           3  Myra Chaudhari  Bengaluru
3                    4       36.903226           4   Jivika Gulati       Pune
4                    5       35.181818           5    Taimur Dugal  Bengaluru

In [39]:
#Sort for performance insight
#Lower delay = better performance
avg_delay_partner_sorted = avg_delay_partner.sort_values(
    by='delivery_delay'
)

avg_delay_partner_sorted.head(10)

,delivery_partner_id,delivery_delay,partner_id,partner_name,city
406,407,23.470588,407,Hansh Anne,Bengaluru
367,368,23.863636,368,Uthkarsh Talwar,Delhi
472,473,23.964286,473,Riaan Choudhary,Ahmedabad
315,316,24.700000,316,Tushar Swamy,Surat
466,467,25.565217,467,Jivin Dixit,Delhi
35,36,25.650000,36,Lagan Wason,Jaipur
95,96,26.214286,96,Zeeshan Garg,Bengaluru
58,59,26.840000,59,Keya Luthra,Surat
47,48,27.666667,48,Lavanya Gala,Kolkata
104,105,27.687500,105,Aaina Ravi,Mumbai

### Markdown Insight
- Delivery partners show noticeable differences in average delivery delay.
- Top-performing partners consistently deliver orders faster, highlighting opportunities to replicate best practices and improve overall delivery efficiency.

In [41]:
#saving the cleaned datasets
output_path = r"E:\Vidya Career\IT JOB\Data Analyst Path\Projects for Data Analysis\Mini PRoject 1\swiggy_cleaned_data.xlsx"

with pd.ExcelWriter(output_path) as writer:
    orders_success.to_excel(writer, sheet_name="orders_cleaned", index=False)
    customers.to_excel(writer, sheet_name="customers", index=False)
    restaurants.to_excel(writer, sheet_name="restaurants", index=False)
    delivery_partners.to_excel(writer, sheet_name="delivery_partners", index=False)

In [42]:
print("Cleaned Swiggy dataset saved successfully!")

Cleaned Swiggy dataset saved successfully!